# -*- coding: utf-8 -*-
#+TITLE: Recursion Schemes, Part 6: Comonads, Composition, and Generality
#+AUTHOR: Patrick Thomson
#+EMAIL: patrick.william.thomson@gmail.com

/Previous installments: [[https://blog.sumtypeofway.com/an-introduction-to-recursion-schemes/][1]], [[https://blog.sumtypeofway.com/recursion-schemes-part-2/][2]], [[https://blog.sumtypeofway.com/recursion-schemes-part-iii-folds-in-context/][3]], [[https://blog.sumtypeofway.com/recursion-schemes-part-iv-time-is-of-the-essence/][4]], [[https://blog.sumtypeofway.com/recursion-schemes-part-41-2-better-living-through-base-functors/][4½]], [[https://blog.sumtypeofway.com/recursion-schemes-part-v/][5]]./

Now that we've covered folds (~cata~, ~para~, and ~histo~), unfolds (~ana~, ~apo~, and ~futu~), and refold (~hylo~, ~hypo~, ~elgot~, and ~chrono~), I hope I have showed that recursion schemes are a useful tool to organize programs, beautify code, and clarify human intent. The above schemes provide sufficient bells and whistles so as to be an essential part of a functional programmer's toolbox.

* Glorious ~gcata~

In the =recursion-schemes= package, we find the generalized catamorphism ~gcata~ defined thus:

#+BEGIN_SRC haskell
gcata :: (Recursive t, Comonad w)
      => (forall b. Base t (w b) -> w (Base t b)) -- ^ a distributive law
      -> (Base t (w a) -> a)                 -- ^ a (Base t)-w-algebra
      -> t                                   -- ^ fixed point
      -> a
#+END_SRC

This is… well, it's a lot to take in. I've omitted[fn:7] the implementation, as it is somewhat dense, but we can start understanding ~gcata~ through its type signature. Let's take a look at the first parameter, described in the documentation as the distributive law:

#+BEGIN_SRC haskell
forall b . Base t (w b) -> w (Base t b)
#+END_SRC

If we recall [[https://blog.sumtypeofway.com/recursion-schemes-part-41-2-better-living-through-base-functors/][part 4.5]] of this series, we'll remember that =recursion-schemes= provides the ~Base~ type family. Given some data type ~t~, ~Base t~ is the parameterized version of ~t~, adding an extra type variable and replacing recursive occurrences of ~t~ with this variable. We can mentally substitute ~f~ for this ~Base t~, which yields something much more like the distributive laws we covered earlier:

#+BEGIN_SRC haskell
forall b . f (w b) -> w (f b)
#+END_SRC

This is congruent with our earlier examples: given some comonad ~w~ and a ~Base~ functor ~f~, this distributive law describes how a ~f~ containing ~w~ values can be turned into a ~w~ containing ~f~ values. And in the subsequent parameter to ~gcata~, we can substitute ~f~ for ~Base t~ yet again:

#+BEGIN_SRC haskell
(f (w a) -> a)
#+END_SRC

This looks a lot like our definition of ~Algebra~, which was ~f a -> a~. Yet instead of a functor wrapping just ~a~ values, this functor wraps ~w a~ values. We'll call this a ~w~-algebra. Stripped of =recursion-schemes='s machinery for ~Base~ (which, though it provides a significant measure of real-world convenience, can clutter up definitions such as these), we can take a look at the essence of ~gcata~:

#+BEGIN_SRC haskell
gcata :: (Functor f, Comonad w)
      => (forall b. f (w b) -> w (f b)) -- ^ a distributive law
      -> (f (w a) -> a)            -- ^ a w-algebra
      -> Term f                    -- ^ fixed point
      -> a
#+END_SRC

This is pretty remarkable. Simply by specifying a ~Comonad~ and providing a distributive law for it, ~gcata~ becomes capable of doing the job of ~cata~, ~para~, and ~histo~, all stemming from a single definition. All you need to do is provide the required distributive law. We can take a look at the type signatures that occur when we feed ~gcata~ one of the ~dist~-family of distributive laws.

#+BEGIN_SRC haskell :results output :exports both
λ> :t gcata distCata
#+END_SRC

#+RESULTS:
: gcata distCata
:    :: Recursive t => (Base t (Identity a) -> a) -> Term f -> a

That looks identical to the ~Identity~-based ~cata~ that we derived above! Let's throw a type synonym in here, as we did for the original formulation of ~cata~, representing the w-algebra

#+BEGIN_SRC haskell
type WAlgebra t w a = Base t (w a) -> a

cata :: Recursive t => WAlgebra t Identity a -> t -> a
cata = gcata distCata
#+END_SRC

Aside from the ~Identity~ comonad, this definition is identical to the standard formulation of ~cata~. In addition, we can define ~para~ and ~histo~ with ~gcata~.

#+BEGIN_SRC haskell
para :: (Recursive t, Corecursive t) => WAlgebra t ((,) t) a -> t -> a
para = gcata distPara

histo :: (Recursive t) => WAlgebra t (Cofree (Base t)) a -> t -> a
histo = gcata distHisto
#+END_SRC

So what happens if we plug in our ~distLedger~ function into ~gcata~?

#+BEGIN_SRC haskell :results output :exports both
λ> :t gcata distLedger
#+END_SRC

#+RESULTS:
: gcata distCata
:    :: (Recursive t, Comonad (Base t)) => (Base t (Ledger t (Base t) a) -> a) -> t -> a

That's almost correct---we have a ~Ledger~-based W-algebra as the first parameter---but a look at the type constraints shows that this definition is slightly wrong. Restricting this function to types that provide an instance of ~Comonad~ for their ~Base~ functor is much too restrictive, given that most ~Base~ functors don't admit a definition of ~Comonad~. Our error lies in the fact that our ~distLedger~ function used comonadic ~extract~ to extract the environment from a ~f (Ledger env f a)~. However, if we're dealing with ~Base~ functors, we can use the ~Corecursive~ typeclass, which provides an ~embed~ that serves, in this case, the purposes of ~extract~, without any ~Comonad~ constraint. We'll use the ~TypeFamilies~ extension to specify that ~f~ is, in this case, equivalent to ~Base t~, to keep clutter out of the right-hand-side of the definition

#+BEGIN_SRC haskell :tangle ../src/Part6.hs
distLedger' :: (Corecursive t, f ~ Base t) => f (Ledger t f a) -> Ledger t f (f a)
distLedger' f = Ledger (EnvT environ cofree) where
  environ = embed (fmap ask f)
  cofree = fmap extract f :< fmap distInnards f
  distInnards (Ledger (EnvT _ (x :< y))) = distHisto y
#+END_SRC

Now we can build a ~Ledger~-powered recursion scheme, without requring any errant ~Comonad~ constraints in its signature.

#+BEGIN_SRC haskell
histoPara :: (Recursive t, Corecursive t) => WAlgebra t (Ledger t (Base t)) a -> t -> a
histoPara = gcata distLedger'
#+END_SRC

Yet we are still left with the problem that haunted us in the previous section: ~distLedger'~ is brittle and difficult to understand. To solve this, =recursion-schemes= has one last trick up its abstraction-drunk sleeve.

* Zero-Effort Distributive Laws

Inside the guts of ~Data.Functor.Foldable~, there lurks a nasty-looking function called ~distParaT~:

#+BEGIN_SRC haskell
distParaT :: (Corecursive t, Comonad w)
          -> (forall b. Base t (w b) -> w (Base t b))
          -> Base t (EnvT t w a)
          -> EnvT t w (Base t a)
#+END_SRC

As with so much in =recursion-schemes=, it's not clear at first what this function does, given its lack of documentation. But if we start adding parentheses in the signature, something jumps out at us:

#+BEGIN_SRC haskell
distParaT :: (Corecursive t, Comonad w)
          -> (forall b. Base t (w b) -> w (Base t b))
          -> (Base t (EnvT t w a) -> EnvT t w (Base t a))
#+END_SRC

Adding parentheses, and thus making the currying explicit, we see that ~distParaT~ both /takes/ and /returns/ a distributive law. The first parameter is a distributive law describing how a comonad ~w~ distributes over a ~Base~ functor: we've seen this before, in the first argument to ~gcata~. The return type is much more interesting: given some distributive law, ~distParaT~ builds /another/ distributive law, wrapping the comonad ~w~ in an ~EnvT~ and distributing appropriately. In this sense, we can think of ~distParaT~ as a distributive-law-transformer: given some 'base' distributive law over ~w~, ~distParaT~ gives us a distributive law over ~EnvT env w~. That's pretty remarkable!

To verify this, we can yield ~distPara~ by passing in ~distCata~:

#+BEGIN_SRC haskell :results output :exports both
λ> :t distParaT distCata
#+END_SRC

#+RESULTS:
: distParaT distCata
:     :: (Corecursive t) => Base t (EnvT t Identity a) -> EnvT t Identity (Base t a)

As we discussed, ~EnvT~ is a comonadic take on the tuple type ~(,)~. As such, if we mentally substitute ~(,)~ for ~EnvT~, we yield a definition equivalent to ~distPara~! (We have to use ~EnvT~ here rather than plain old ~(,)~ because we are dealing in comonad transformers: there exists no ~TupleT~ transformer, since it would be the same as ~EnvT~).

We've established that our ~Ledger~ comonad is the composition of the ~Env~ and ~Cofree~ comonads, the former atop the latter. Since ~distParaT~ transforms distributive laws into ~EnvT~-compatible laws, and we already have a distributive law for ~Cofree~, ~distHisto~. What happens if we pass ~distHisto~ to ~distParaT~?

#+BEGIN_SRC haskell :results output :exports both
λ> :t distParaT distHisto
#+END_SRC

#+RESULTS:
: distParaT distHisto
:     :: Corecursive t
:     => Base t (EnvT t (Cofree (Base t)) a)
:     -> EnvT t (Cofree (Base t)) (Base t a)

This yields us something almost identical to ~Ledger~---remember that ~Ledger t f a~ wraps a ~EnvT t (Cofree f) a~. Now we can, with some invocations of the ~Ledger~ constructor and ~getLedger~ destructor, write ~distLedger~ without a single pattern-match[fn:8]:

#+BEGIN_SRC haskell :tangle ../src/Part6.hs
distLedger'' :: Corecursive t => Base t (Ledger t (Base t) a) -> Ledger t (Base t) (Base t a)
distLedger'' = fmap getLedger >>> distParaT distHisto >>> Ledger
#+END_SRC

The upshot of all of this is that, thanks to the generality of ~gcata~, you can combine arbitrary capabilities, from any type of fold, into a bespoke fold that exactly fits the problem at hand. Furthermore, you never need to write a distributive law by hand: the distributive-law-transformers like ~distParaT~ and its siblings ~distGHisto~[fn:6] and ~distZygoT~ make it straightforward to derive, given a comonad built of comonad transformers, a well-typed distributive law. Every recursion scheme is, under the hood, wrought of the same material. There is an order to these functions, almost symphonic in nature, that, in my view, elevates recursion schemes from 'hey, this is cool' to something deep and fundamental about the nature of recursive computations. Just as the integral and differential calculus allowed Newton and Leibniz to unify the treatment of curves, motion, and infintesimals, /Recursion Schemes from Comonads/ allows us to unify folds, dynamic programming, and mutually-recursive computations (~zygo~). There is a beauty to this treatment of recursion that is symphonic in its harmony.

[fn:8] Given that the result of ~distParaT distHisto~ is isomorphic to ~Ledger t (Base t) a~, we ought to be able to apply ~Data.Coerce.coerce~ to it and have the ~Ledger~ and ~getLedger~ constructors and eliminators applied for us; GHC, however, can't yet prove that this is a well-founded coercion. We have at least the small consolation that GHC will optimize away the overhead of wrapping and unwrapping ~Ledger~ values.

